SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 FEFILT register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_FEFILT_H
#define EFR32FG25_FEFILT_H
#define FEFILT_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_FEFILT FEFILT
 * @{
 * @brief EFR32FG25 FEFILT Register Declaration.
 *****************************************************************************/

/** FEFILT IRCALCOEFWR Register Group Declaration. */
typedef struct {
  __IOM uint32_t IRCALCOEFWR;                        /**< IRCAL COEF WR per antenna                          */
} FEFILT_IRCALCOEFWR_TypeDef;

/** FEFILT Register Declaration. */
typedef struct {
  __IM uint32_t              IPVERSION;           /**< IP version ID                                      */
  __IOM uint32_t             EN;                  /**< Enable peripheral clock to this module             */
  __IOM uint32_t             SWRST;               /**< Software reset of the module                       */
  __IM uint32_t              STATUS;              /**< Status Register                                    */
  __IOM uint32_t             LOCK;                /**< Configuration Lock Key                             */
  __IOM uint32_t             CFG;                 /**< Configuration register                             */
  __IOM uint32_t             CMD;                 /**< Command register                                   */
  uint32_t                   RESERVED0[57U];      /**< Reserved for future use                            */
  __IOM uint32_t             CF;                  /**< Channel Filter                                     */
  __IOM uint32_t             SRC;                 /**< SRC values                                         */
  __IOM uint32_t             DIGIGAINCTRL;        /**< Digital Gain Control                               */
  __IOM uint32_t             CHFCOE00;            /**< CHF COE. Set0 group0                               */
  __IOM uint32_t             CHFCOE01;            /**< CHF COE. Set0 group1                               */
  __IOM uint32_t             CHFCOE02;            /**< CHF COE. Set0 group2                               */
  __IOM uint32_t             CHFCOE03;            /**< CHF COE. Set0 group3                               */
  __IOM uint32_t             CHFCOE04;            /**< CHF COE. Set0 group4                               */
  __IOM uint32_t             CHFCOE05;            /**< CHF COE. Set0 group5                               */
  __IOM uint32_t             CHFCOE06;            /**< CHF COE. Set0 group6                               */
  __IOM uint32_t             CHFCOE10;            /**< CHF COE. Set1 group0                               */
  __IOM uint32_t             CHFCOE11;            /**< CHF COE. Set1 group1                               */
  __IOM uint32_t             CHFCOE12;            /**< CHF COE. Set1 group2                               */
  __IOM uint32_t             CHFCOE13;            /**< CHF COE. Set1 group3                               */
  __IOM uint32_t             CHFCOE15;            /**< CHF COE. Set1 group5                               */
  __IOM uint32_t             CHFCOE14;            /**< CHF COE. Set1 group4                               */
  __IOM uint32_t             CHFCOE16;            /**< CHF COE. Set1 group6                               */
  __IOM uint32_t             CHFCTRL;             /**< CHF control                                        */
  uint32_t                   RESERVED1[1U];       /**< Reserved for future use                            */
  __IOM uint32_t             CTRL;                /**< FEFILT control register                            */
  __IOM uint32_t             BLANKING;            /**< BLANKING CTRL                                      */
  __IOM uint32_t             RSSIFILT;            /**< OOB Filter for RSSI                                */
  uint32_t                   RESERVED2[10U];      /**< Reserved for future use                            */
  __IOM uint32_t             DIGMIXCTRL;          /**< Digital mixer control register                     */
  uint32_t                   RESERVED3[31U];      /**< Reserved for future use                            */
  __IOM uint32_t             DCCOMP;              /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t             DCCOMPFILTINIT;      /**< DC Offset compensation Filter                      */
  __IM uint32_t              DCESTI;              /**< DC Offset Estimated value                          */
  uint32_t                   RESERVED4[17U];      /**< Reserved for future use                            */
  __IOM uint32_t             IRCAL;               /**< IRCAL control signals                              */
  __IM uint32_t              IRCALCOEF;           /**< IRCAL COEF values                                  */
  uint32_t                   RESERVED5[42U];      /**< Reserved for future use                            */
  FEFILT_IRCALCOEFWR_TypeDef IRCALCOEFWR[2U];     /**< IRCAL                                              */
  uint32_t                   RESERVED6[830U];     /**< Reserved for future use                            */
  __IM uint32_t              IPVERSION_SET;       /**< IP version ID                                      */
  __IOM uint32_t             EN_SET;              /**< Enable peripheral clock to this module             */
  __IOM uint32_t             SWRST_SET;           /**< Software reset of the module                       */
  __IM uint32_t              STATUS_SET;          /**< Status Register                                    */
  __IOM uint32_t             LOCK_SET;            /**< Configuration Lock Key                             */
  __IOM uint32_t             CFG_SET;             /**< Configuration register                             */
  __IOM uint32_t             CMD_SET;             /**< Command register                                   */
  uint32_t                   RESERVED7[57U];      /**< Reserved for future use                            */
  __IOM uint32_t             CF_SET;              /**< Channel Filter                                     */
  __IOM uint32_t             SRC_SET;             /**< SRC values                                         */
  __IOM uint32_t             DIGIGAINCTRL_SET;    /**< Digital Gain Control                               */
  __IOM uint32_t             CHFCOE00_SET;        /**< CHF COE. Set0 group0                               */
  __IOM uint32_t             CHFCOE01_SET;        /**< CHF COE. Set0 group1                               */
  __IOM uint32_t             CHFCOE02_SET;        /**< CHF COE. Set0 group2                               */
  __IOM uint32_t             CHFCOE03_SET;        /**< CHF COE. Set0 group3                               */
  __IOM uint32_t             CHFCOE04_SET;        /**< CHF COE. Set0 group4                               */
  __IOM uint32_t             CHFCOE05_SET;        /**< CHF COE. Set0 group5                               */
  __IOM uint32_t             CHFCOE06_SET;        /**< CHF COE. Set0 group6                               */
  __IOM uint32_t             CHFCOE10_SET;        /**< CHF COE. Set1 group0                               */
  __IOM uint32_t             CHFCOE11_SET;        /**< CHF COE. Set1 group1                               */
  __IOM uint32_t             CHFCOE12_SET;        /**< CHF COE. Set1 group2                               */
  __IOM uint32_t             CHFCOE13_SET;        /**< CHF COE. Set1 group3                               */
  __IOM uint32_t             CHFCOE15_SET;        /**< CHF COE. Set1 group5                               */
  __IOM uint32_t             CHFCOE14_SET;        /**< CHF COE. Set1 group4                               */
  __IOM uint32_t             CHFCOE16_SET;        /**< CHF COE. Set1 group6                               */
  __IOM uint32_t             CHFCTRL_SET;         /**< CHF control                                        */
  uint32_t                   RESERVED8[1U];       /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_SET;            /**< FEFILT control register                            */
  __IOM uint32_t             BLANKING_SET;        /**< BLANKING CTRL                                      */
  __IOM uint32_t             RSSIFILT_SET;        /**< OOB Filter for RSSI                                */
  uint32_t                   RESERVED9[10U];      /**< Reserved for future use                            */
  __IOM uint32_t             DIGMIXCTRL_SET;      /**< Digital mixer control register                     */
  uint32_t                   RESERVED10[31U];     /**< Reserved for future use                            */
  __IOM uint32_t             DCCOMP_SET;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t             DCCOMPFILTINIT_SET;  /**< DC Offset compensation Filter                      */
  __IM uint32_t              DCESTI_SET;          /**< DC Offset Estimated value                          */
  uint32_t                   RESERVED11[17U];     /**< Reserved for future use                            */
  __IOM uint32_t             IRCAL_SET;           /**< IRCAL control signals                              */
  __IM uint32_t              IRCALCOEF_SET;       /**< IRCAL COEF values                                  */
  uint32_t                   RESERVED12[42U];     /**< Reserved for future use                            */
  FEFILT_IRCALCOEFWR_TypeDef IRCALCOEFWR_SET[2U]; /**< IRCAL                                              */
  uint32_t                   RESERVED13[830U];    /**< Reserved for future use                            */
  __IM uint32_t              IPVERSION_CLR;       /**< IP version ID                                      */
  __IOM uint32_t             EN_CLR;              /**< Enable peripheral clock to this module             */
  __IOM uint32_t             SWRST_CLR;           /**< Software reset of the module                       */
  __IM uint32_t              STATUS_CLR;          /**< Status Register                                    */
  __IOM uint32_t             LOCK_CLR;            /**< Configuration Lock Key                             */
  __IOM uint32_t             CFG_CLR;             /**< Configuration register                             */
  __IOM uint32_t             CMD_CLR;             /**< Command register                                   */
  uint32_t                   RESERVED14[57U];     /**< Reserved for future use                            */
  __IOM uint32_t             CF_CLR;              /**< Channel Filter                                     */
  __IOM uint32_t             SRC_CLR;             /**< SRC values                                         */
  __IOM uint32_t             DIGIGAINCTRL_CLR;    /**< Digital Gain Control                               */
  __IOM uint32_t             CHFCOE00_CLR;        /**< CHF COE. Set0 group0                               */
  __IOM uint32_t             CHFCOE01_CLR;        /**< CHF COE. Set0 group1                               */
  __IOM uint32_t             CHFCOE02_CLR;        /**< CHF COE. Set0 group2                               */
  __IOM uint32_t             CHFCOE03_CLR;        /**< CHF COE. Set0 group3                               */
  __IOM uint32_t             CHFCOE04_CLR;        /**< CHF COE. Set0 group4                               */
  __IOM uint32_t             CHFCOE05_CLR;        /**< CHF COE. Set0 group5                               */
  __IOM uint32_t             CHFCOE06_CLR;        /**< CHF COE. Set0 group6                               */
  __IOM uint32_t             CHFCOE10_CLR;        /**< CHF COE. Set1 group0                               */
  __IOM uint32_t             CHFCOE11_CLR;        /**< CHF COE. Set1 group1                               */
  __IOM uint32_t             CHFCOE12_CLR;        /**< CHF COE. Set1 group2                               */
  __IOM uint32_t             CHFCOE13_CLR;        /**< CHF COE. Set1 group3                               */
  __IOM uint32_t             CHFCOE15_CLR;        /**< CHF COE. Set1 group5                               */
  __IOM uint32_t             CHFCOE14_CLR;        /**< CHF COE. Set1 group4                               */
  __IOM uint32_t             CHFCOE16_CLR;        /**< CHF COE. Set1 group6                               */
  __IOM uint32_t             CHFCTRL_CLR;         /**< CHF control                                        */
  uint32_t                   RESERVED15[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_CLR;            /**< FEFILT control register                            */
  __IOM uint32_t             BLANKING_CLR;        /**< BLANKING CTRL                                      */
  __IOM uint32_t             RSSIFILT_CLR;        /**< OOB Filter for RSSI                                */
  uint32_t                   RESERVED16[10U];     /**< Reserved for future use                            */
  __IOM uint32_t             DIGMIXCTRL_CLR;      /**< Digital mixer control register                     */
  uint32_t                   RESERVED17[31U];     /**< Reserved for future use                            */
  __IOM uint32_t             DCCOMP_CLR;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t             DCCOMPFILTINIT_CLR;  /**< DC Offset compensation Filter                      */
  __IM uint32_t              DCESTI_CLR;          /**< DC Offset Estimated value                          */
  uint32_t                   RESERVED18[17U];     /**< Reserved for future use                            */
  __IOM uint32_t             IRCAL_CLR;           /**< IRCAL control signals                              */
  __IM uint32_t              IRCALCOEF_CLR;       /**< IRCAL COEF values                                  */
  uint32_t                   RESERVED19[42U];     /**< Reserved for future use                            */
  FEFILT_IRCALCOEFWR_TypeDef IRCALCOEFWR_CLR[2U]; /**< IRCAL                                              */
  uint32_t                   RESERVED20[830U];    /**< Reserved for future use                            */
  __IM uint32_t              IPVERSION_TGL;       /**< IP version ID                                      */
  __IOM uint32_t             EN_TGL;              /**< Enable peripheral clock to this module             */
  __IOM uint32_t             SWRST_TGL;           /**< Software reset of the module                       */
  __IM uint32_t              STATUS_TGL;          /**< Status Register                                    */
  __IOM uint32_t             LOCK_TGL;            /**< Configuration Lock Key                             */
  __IOM uint32_t             CFG_TGL;             /**< Configuration register                             */
  __IOM uint32_t             CMD_TGL;             /**< Command register                                   */
  uint32_t                   RESERVED21[57U];     /**< Reserved for future use                            */
  __IOM uint32_t             CF_TGL;              /**< Channel Filter                                     */
  __IOM uint32_t             SRC_TGL;             /**< SRC values                                         */
  __IOM uint32_t             DIGIGAINCTRL_TGL;    /**< Digital Gain Control                               */
  __IOM uint32_t             CHFCOE00_TGL;        /**< CHF COE. Set0 group0                               */
  __IOM uint32_t             CHFCOE01_TGL;        /**< CHF COE. Set0 group1                               */
  __IOM uint32_t             CHFCOE02_TGL;        /**< CHF COE. Set0 group2                               */
  __IOM uint32_t             CHFCOE03_TGL;        /**< CHF COE. Set0 group3                               */
  __IOM uint32_t             CHFCOE04_TGL;        /**< CHF COE. Set0 group4                               */
  __IOM uint32_t             CHFCOE05_TGL;        /**< CHF COE. Set0 group5                               */
  __IOM uint32_t             CHFCOE06_TGL;        /**< CHF COE. Set0 group6                               */
  __IOM uint32_t             CHFCOE10_TGL;        /**< CHF COE. Set1 group0                               */
  __IOM uint32_t             CHFCOE11_TGL;        /**< CHF COE. Set1 group1                               */
  __IOM uint32_t             CHFCOE12_TGL;        /**< CHF COE. Set1 group2                               */
  __IOM uint32_t             CHFCOE13_TGL;        /**< CHF COE. Set1 group3                               */
  __IOM uint32_t             CHFCOE15_TGL;        /**< CHF COE. Set1 group5                               */
  __IOM uint32_t             CHFCOE14_TGL;        /**< CHF COE. Set1 group4                               */
  __IOM uint32_t             CHFCOE16_TGL;        /**< CHF COE. Set1 group6                               */
  __IOM uint32_t             CHFCTRL_TGL;         /**< CHF control                                        */
  uint32_t                   RESERVED22[1U];      /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_TGL;            /**< FEFILT control register                            */
  __IOM uint32_t             BLANKING_TGL;        /**< BLANKING CTRL                                      */
  __IOM uint32_t             RSSIFILT_TGL;        /**< OOB Filter for RSSI                                */
  uint32_t                   RESERVED23[10U];     /**< Reserved for future use                            */
  __IOM uint32_t             DIGMIXCTRL_TGL;      /**< Digital mixer control register                     */
  uint32_t                   RESERVED24[31U];     /**< Reserved for future use                            */
  __IOM uint32_t             DCCOMP_TGL;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t             DCCOMPFILTINIT_TGL;  /**< DC Offset compensation Filter                      */
  __IM uint32_t              DCESTI_TGL;          /**< DC Offset Estimated value                          */
  uint32_t                   RESERVED25[17U];     /**< Reserved for future use                            */
  __IOM uint32_t             IRCAL_TGL;           /**< IRCAL control signals                              */
  __IM uint32_t              IRCALCOEF_TGL;       /**< IRCAL COEF values                                  */
  uint32_t                   RESERVED26[42U];     /**< Reserved for future use                            */
  FEFILT_IRCALCOEFWR_TypeDef IRCALCOEFWR_TGL[2U]; /**< IRCAL                                              */
} FEFILT_TypeDef;
