SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/** @} End of group EFR32FG25_FEFILT */

/**************************************************************************//**
 * @addtogroup EFR32FG25_FEFILT
 * @{
 * @defgroup EFR32FG25_FEFILT_BitFields FEFILT Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for FEFILT IPVERSION */
#define _FEFILT_IPVERSION_RESETVALUE                     0x00000001UL                               /**< Default value for FEFILT_IPVERSION          */
#define _FEFILT_IPVERSION_MASK                           0xFFFFFFFFUL                               /**< Mask for FEFILT_IPVERSION                   */
#define _FEFILT_IPVERSION_IPVERSION_SHIFT                0                                          /**< Shift value for FEFILT_IPVERSION            */
#define _FEFILT_IPVERSION_IPVERSION_MASK                 0xFFFFFFFFUL                               /**< Bit mask for FEFILT_IPVERSION               */
#define _FEFILT_IPVERSION_IPVERSION_DEFAULT              0x00000001UL                               /**< Mode DEFAULT for FEFILT_IPVERSION           */
#define FEFILT_IPVERSION_IPVERSION_DEFAULT               (_FEFILT_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_IPVERSION   */

/* Bit fields for FEFILT EN */
#define _FEFILT_EN_RESETVALUE                            0x00000000UL                        /**< Default value for FEFILT_EN                 */
#define _FEFILT_EN_MASK                                  0x00000003UL                        /**< Mask for FEFILT_EN                          */
#define FEFILT_EN_EN                                     (0x1UL << 0)                        /**< Module enable                               */
#define _FEFILT_EN_EN_SHIFT                              0                                   /**< Shift value for FEFILT_EN                   */
#define _FEFILT_EN_EN_MASK                               0x1UL                               /**< Bit mask for FEFILT_EN                      */
#define _FEFILT_EN_EN_DEFAULT                            0x00000000UL                        /**< Mode DEFAULT for FEFILT_EN                  */
#define FEFILT_EN_EN_DEFAULT                             (_FEFILT_EN_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for FEFILT_EN          */
#define FEFILT_EN_DISABLING                              (0x1UL << 1)                        /**< Disablement busy status                     */
#define _FEFILT_EN_DISABLING_SHIFT                       1                                   /**< Shift value for FEFILT_DISABLING            */
#define _FEFILT_EN_DISABLING_MASK                        0x2UL                               /**< Bit mask for FEFILT_DISABLING               */
#define _FEFILT_EN_DISABLING_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for FEFILT_EN                  */
#define FEFILT_EN_DISABLING_DEFAULT                      (_FEFILT_EN_DISABLING_DEFAULT << 1) /**< Shifted mode DEFAULT for FEFILT_EN          */

/* Bit fields for FEFILT SWRST */
#define _FEFILT_SWRST_RESETVALUE                         0x00000000UL                           /**< Default value for FEFILT_SWRST              */
#define _FEFILT_SWRST_MASK                               0x00000003UL                           /**< Mask for FEFILT_SWRST                       */
#define FEFILT_SWRST_SWRST                               (0x1UL << 0)                           /**< Software reset command                      */
#define _FEFILT_SWRST_SWRST_SHIFT                        0                                      /**< Shift value for FEFILT_SWRST                */
#define _FEFILT_SWRST_SWRST_MASK                         0x1UL                                  /**< Bit mask for FEFILT_SWRST                   */
#define _FEFILT_SWRST_SWRST_DEFAULT                      0x00000000UL                           /**< Mode DEFAULT for FEFILT_SWRST               */
#define FEFILT_SWRST_SWRST_DEFAULT                       (_FEFILT_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for FEFILT_SWRST       */
#define FEFILT_SWRST_RESETTING                           (0x1UL << 1)                           /**< Software reset busy status                  */
#define _FEFILT_SWRST_RESETTING_SHIFT                    1                                      /**< Shift value for FEFILT_RESETTING            */
#define _FEFILT_SWRST_RESETTING_MASK                     0x2UL                                  /**< Bit mask for FEFILT_RESETTING               */
#define _FEFILT_SWRST_RESETTING_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for FEFILT_SWRST               */
#define FEFILT_SWRST_RESETTING_DEFAULT                   (_FEFILT_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for FEFILT_SWRST       */

/* Bit fields for FEFILT STATUS */
#define _FEFILT_STATUS_RESETVALUE                        0x00000000UL                                    /**< Default value for FEFILT_STATUS             */
#define _FEFILT_STATUS_MASK                              0x00000001UL                                    /**< Mask for FEFILT_STATUS                      */
#define FEFILT_STATUS_FEFILTLOCKSTATUS                   (0x1UL << 0)                                    /**< Lock Status                                 */
#define _FEFILT_STATUS_FEFILTLOCKSTATUS_SHIFT            0                                               /**< Shift value for FEFILT_FEFILTLOCKSTATUS     */
#define _FEFILT_STATUS_FEFILTLOCKSTATUS_MASK             0x1UL                                           /**< Bit mask for FEFILT_FEFILTLOCKSTATUS        */
#define _FEFILT_STATUS_FEFILTLOCKSTATUS_DEFAULT          0x00000000UL                                    /**< Mode DEFAULT for FEFILT_STATUS              */
#define _FEFILT_STATUS_FEFILTLOCKSTATUS_UNLOCKED         0x00000000UL                                    /**< Mode UNLOCKED for FEFILT_STATUS             */
#define _FEFILT_STATUS_FEFILTLOCKSTATUS_LOCKED           0x00000001UL                                    /**< Mode LOCKED for FEFILT_STATUS               */
#define FEFILT_STATUS_FEFILTLOCKSTATUS_DEFAULT           (_FEFILT_STATUS_FEFILTLOCKSTATUS_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_STATUS      */
#define FEFILT_STATUS_FEFILTLOCKSTATUS_UNLOCKED          (_FEFILT_STATUS_FEFILTLOCKSTATUS_UNLOCKED << 0) /**< Shifted mode UNLOCKED for FEFILT_STATUS     */
#define FEFILT_STATUS_FEFILTLOCKSTATUS_LOCKED            (_FEFILT_STATUS_FEFILTLOCKSTATUS_LOCKED << 0)   /**< Shifted mode LOCKED for FEFILT_STATUS       */

/* Bit fields for FEFILT LOCK */
#define _FEFILT_LOCK_RESETVALUE                          0x00000000UL                              /**< Default value for FEFILT_LOCK               */
#define _FEFILT_LOCK_MASK                                0x0000FFFFUL                              /**< Mask for FEFILT_LOCK                        */
#define _FEFILT_LOCK_FEFILTLOCKKEY_SHIFT                 0                                         /**< Shift value for FEFILT_FEFILTLOCKKEY        */
#define _FEFILT_LOCK_FEFILTLOCKKEY_MASK                  0xFFFFUL                                  /**< Bit mask for FEFILT_FEFILTLOCKKEY           */
#define _FEFILT_LOCK_FEFILTLOCKKEY_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for FEFILT_LOCK                */
#define _FEFILT_LOCK_FEFILTLOCKKEY_UNLOCK                0x000027A1UL                              /**< Mode UNLOCK for FEFILT_LOCK                 */
#define FEFILT_LOCK_FEFILTLOCKKEY_DEFAULT                (_FEFILT_LOCK_FEFILTLOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_LOCK        */
#define FEFILT_LOCK_FEFILTLOCKKEY_UNLOCK                 (_FEFILT_LOCK_FEFILTLOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for FEFILT_LOCK         */

/* Bit fields for FEFILT CFG */
#define _FEFILT_CFG_RESETVALUE                           0x00000000UL                                 /**< Default value for FEFILT_CFG                */
#define _FEFILT_CFG_MASK                                 0x00000001UL                                 /**< Mask for FEFILT_CFG                         */
#define FEFILT_CFG_LOSYNCRESETENABLE                     (0x1UL << 0)                                 /**< Enable sync reset of ADC clock domain       */
#define _FEFILT_CFG_LOSYNCRESETENABLE_SHIFT              0                                            /**< Shift value for FEFILT_LOSYNCRESETENABLE    */
#define _FEFILT_CFG_LOSYNCRESETENABLE_MASK               0x1UL                                        /**< Bit mask for FEFILT_LOSYNCRESETENABLE       */
#define _FEFILT_CFG_LOSYNCRESETENABLE_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CFG                 */
#define FEFILT_CFG_LOSYNCRESETENABLE_DEFAULT             (_FEFILT_CFG_LOSYNCRESETENABLE_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_CFG         */

