SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT CMD */
#define _FEFILT_CMD_RESETVALUE                           0x00000000UL                            /**< Default value for FEFILT_CMD                */
#define _FEFILT_CMD_MASK                                 0x00000001UL                            /**< Mask for FEFILT_CMD                         */
#define FEFILT_CMD_SWGAINCHANGE                          (0x1UL << 0)                            /**< Gainchange request cmd                      */
#define _FEFILT_CMD_SWGAINCHANGE_SHIFT                   0                                       /**< Shift value for FEFILT_SWGAINCHANGE         */
#define _FEFILT_CMD_SWGAINCHANGE_MASK                    0x1UL                                   /**< Bit mask for FEFILT_SWGAINCHANGE            */
#define _FEFILT_CMD_SWGAINCHANGE_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for FEFILT_CMD                 */
#define FEFILT_CMD_SWGAINCHANGE_DEFAULT                  (_FEFILT_CMD_SWGAINCHANGE_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_CMD         */

/* Bit fields for FEFILT CF */
#define _FEFILT_CF_RESETVALUE                            0x00000000UL                     /**< Default value for FEFILT_CF                 */
#define _FEFILT_CF_MASK                                  0xC001FFFFUL                     /**< Mask for FEFILT_CF                          */
#define _FEFILT_CF_DEC0_SHIFT                            0                                /**< Shift value for FEFILT_DEC0                 */
#define _FEFILT_CF_DEC0_MASK                             0x7UL                            /**< Bit mask for FEFILT_DEC0                    */
#define _FEFILT_CF_DEC0_DEFAULT                          0x00000000UL                     /**< Mode DEFAULT for FEFILT_CF                  */
#define _FEFILT_CF_DEC0_DF3                              0x00000000UL                     /**< Mode DF3 for FEFILT_CF                      */
#define _FEFILT_CF_DEC0_DF4WIDE                          0x00000001UL                     /**< Mode DF4WIDE for FEFILT_CF                  */
#define _FEFILT_CF_DEC0_DF4NARROW                        0x00000002UL                     /**< Mode DF4NARROW for FEFILT_CF                */
#define _FEFILT_CF_DEC0_DF8WIDE                          0x00000003UL                     /**< Mode DF8WIDE for FEFILT_CF                  */
#define _FEFILT_CF_DEC0_DF8NARROW                        0x00000004UL                     /**< Mode DF8NARROW for FEFILT_CF                */
#define _FEFILT_CF_DEC0_DF5                              0x00000005UL                     /**< Mode DF5 for FEFILT_CF                      */
#define FEFILT_CF_DEC0_DEFAULT                           (_FEFILT_CF_DEC0_DEFAULT << 0)   /**< Shifted mode DEFAULT for FEFILT_CF          */
#define FEFILT_CF_DEC0_DF3                               (_FEFILT_CF_DEC0_DF3 << 0)       /**< Shifted mode DF3 for FEFILT_CF              */
#define FEFILT_CF_DEC0_DF4WIDE                           (_FEFILT_CF_DEC0_DF4WIDE << 0)   /**< Shifted mode DF4WIDE for FEFILT_CF          */
#define FEFILT_CF_DEC0_DF4NARROW                         (_FEFILT_CF_DEC0_DF4NARROW << 0) /**< Shifted mode DF4NARROW for FEFILT_CF        */
#define FEFILT_CF_DEC0_DF8WIDE                           (_FEFILT_CF_DEC0_DF8WIDE << 0)   /**< Shifted mode DF8WIDE for FEFILT_CF          */
#define FEFILT_CF_DEC0_DF8NARROW                         (_FEFILT_CF_DEC0_DF8NARROW << 0) /**< Shifted mode DF8NARROW for FEFILT_CF        */
#define FEFILT_CF_DEC0_DF5                               (_FEFILT_CF_DEC0_DF5 << 0)       /**< Shifted mode DF5 for FEFILT_CF              */
#define _FEFILT_CF_DEC1_SHIFT                            3                                /**< Shift value for FEFILT_DEC1                 */
#define _FEFILT_CF_DEC1_MASK                             0x1FFF8UL                        /**< Bit mask for FEFILT_DEC1                    */
#define _FEFILT_CF_DEC1_DEFAULT                          0x00000000UL                     /**< Mode DEFAULT for FEFILT_CF                  */
#define FEFILT_CF_DEC1_DEFAULT                           (_FEFILT_CF_DEC1_DEFAULT << 3)   /**< Shifted mode DEFAULT for FEFILT_CF          */

/* Bit fields for FEFILT SRC */
#define _FEFILT_SRC_RESETVALUE                           0x00000000UL                          /**< Default value for FEFILT_SRC                */
#define _FEFILT_SRC_MASK                                 0x39CFFFFFUL                          /**< Mask for FEFILT_SRC                         */
#define _FEFILT_SRC_SRCRATIO_SHIFT                       0                                     /**< Shift value for FEFILT_SRCRATIO             */
#define _FEFILT_SRC_SRCRATIO_MASK                        0xFFFFFUL                             /**< Bit mask for FEFILT_SRCRATIO                */
#define _FEFILT_SRC_SRCRATIO_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for FEFILT_SRC                 */
#define FEFILT_SRC_SRCRATIO_DEFAULT                      (_FEFILT_SRC_SRCRATIO_DEFAULT << 0)   /**< Shifted mode DEFAULT for FEFILT_SRC         */
#define _FEFILT_SRC_UPGAPS_SHIFT                         22                                    /**< Shift value for FEFILT_UPGAPS               */
#define _FEFILT_SRC_UPGAPS_MASK                          0x1C00000UL                           /**< Bit mask for FEFILT_UPGAPS                  */
#define _FEFILT_SRC_UPGAPS_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for FEFILT_SRC                 */
#define FEFILT_SRC_UPGAPS_DEFAULT                        (_FEFILT_SRC_UPGAPS_DEFAULT << 22)    /**< Shifted mode DEFAULT for FEFILT_SRC         */
#define FEFILT_SRC_SRCENABLE                             (0x1UL << 27)                         /**< SRC enable                                  */
#define _FEFILT_SRC_SRCENABLE_SHIFT                      27                                    /**< Shift value for FEFILT_SRCENABLE            */
#define _FEFILT_SRC_SRCENABLE_MASK                       0x8000000UL                           /**< Bit mask for FEFILT_SRCENABLE               */
#define _FEFILT_SRC_SRCENABLE_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for FEFILT_SRC                 */
#define FEFILT_SRC_SRCENABLE_DEFAULT                     (_FEFILT_SRC_SRCENABLE_DEFAULT << 27) /**< Shifted mode DEFAULT for FEFILT_SRC         */
#define _FEFILT_SRC_SRCSRD_SHIFT                         28                                    /**< Shift value for FEFILT_SRCSRD               */
#define _FEFILT_SRC_SRCSRD_MASK                          0x30000000UL                          /**< Bit mask for FEFILT_SRCSRD                  */
#define _FEFILT_SRC_SRCSRD_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for FEFILT_SRC                 */
#define _FEFILT_SRC_SRCSRD_NODEC                         0x00000000UL                          /**< Mode NODEC for FEFILT_SRC                   */
#define _FEFILT_SRC_SRCSRD_DEC2                          0x00000001UL                          /**< Mode DEC2 for FEFILT_SRC                    */
#define _FEFILT_SRC_SRCSRD_DEC3                          0x00000002UL                          /**< Mode DEC3 for FEFILT_SRC                    */
#define _FEFILT_SRC_SRCSRD_DEC4                          0x00000003UL                          /**< Mode DEC4 for FEFILT_SRC                    */
#define FEFILT_SRC_SRCSRD_DEFAULT                        (_FEFILT_SRC_SRCSRD_DEFAULT << 28)    /**< Shifted mode DEFAULT for FEFILT_SRC         */
#define FEFILT_SRC_SRCSRD_NODEC                          (_FEFILT_SRC_SRCSRD_NODEC << 28)      /**< Shifted mode NODEC for FEFILT_SRC           */
#define FEFILT_SRC_SRCSRD_DEC2                           (_FEFILT_SRC_SRCSRD_DEC2 << 28)       /**< Shifted mode DEC2 for FEFILT_SRC            */
#define FEFILT_SRC_SRCSRD_DEC3                           (_FEFILT_SRC_SRCSRD_DEC3 << 28)       /**< Shifted mode DEC3 for FEFILT_SRC            */
#define FEFILT_SRC_SRCSRD_DEC4                           (_FEFILT_SRC_SRCSRD_DEC4 << 28)       /**< Shifted mode DEC4 for FEFILT_SRC            */

/* Bit fields for FEFILT DIGIGAINCTRL */
#define _FEFILT_DIGIGAINCTRL_RESETVALUE                  0x00000000UL                                   /**< Default value for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_MASK                        0x0000FFFFUL                                   /**< Mask for FEFILT_DIGIGAINCTRL                */
#define FEFILT_DIGIGAINCTRL_DIGIGAINEN                   (0x1UL << 0)                                   /**< Digital Gain Enable                         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAINEN_SHIFT            0                                              /**< Shift value for FEFILT_DIGIGAINEN           */
#define _FEFILT_DIGIGAINCTRL_DIGIGAINEN_MASK             0x1UL                                          /**< Bit mask for FEFILT_DIGIGAINEN              */
#define _FEFILT_DIGIGAINCTRL_DIGIGAINEN_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for FEFILT_DIGIGAINCTRL        */
#define FEFILT_DIGIGAINCTRL_DIGIGAINEN_DEFAULT           (_FEFILT_DIGIGAINCTRL_DIGIGAINEN_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_DIGIGAINCTRL*/
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_SHIFT              1                                              /**< Shift value for FEFILT_DIGIGAIN             */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_MASK               0x1FEUL                                        /**< Bit mask for FEFILT_DIGIGAIN                */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for FEFILT_DIGIGAINCTRL        */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM3             0x00000000UL                                   /**< Mode GAINM3 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P75          0x00000001UL                                   /**< Mode GAINM2P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P5           0x00000002UL                                   /**< Mode GAINM2P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P25          0x00000003UL                                   /**< Mode GAINM2P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2             0x00000004UL                                   /**< Mode GAINM2 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P75          0x00000005UL                                   /**< Mode GAINM1P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P5           0x00000006UL                                   /**< Mode GAINM1P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P25          0x00000007UL                                   /**< Mode GAINM1P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1             0x00000008UL                                   /**< Mode GAINM1 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P75          0x00000009UL                                   /**< Mode GAINM0P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P5           0x0000000AUL                                   /**< Mode GAINM0P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P25          0x0000000BUL                                   /**< Mode GAINM0P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0             0x0000000CUL                                   /**< Mode GAINM0 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P25          0x0000000DUL                                   /**< Mode GAINP0P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P5           0x0000000EUL                                   /**< Mode GAINP0P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P75          0x0000000FUL                                   /**< Mode GAINP0P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1             0x00000010UL                                   /**< Mode GAINP1 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P25          0x00000011UL                                   /**< Mode GAINP1P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P5           0x00000012UL                                   /**< Mode GAINP1P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P75          0x00000013UL                                   /**< Mode GAINP1P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2             0x00000014UL                                   /**< Mode GAINP2 for FEFILT_DIGIGAINCTRL         */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P25          0x00000015UL                                   /**< Mode GAINP2P25 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P5           0x00000016UL                                   /**< Mode GAINP2P5 for FEFILT_DIGIGAINCTRL       */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P75          0x00000017UL                                   /**< Mode GAINP2P75 for FEFILT_DIGIGAINCTRL      */
#define _FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP3             0x00000018UL                                   /**< Mode GAINP3 for FEFILT_DIGIGAINCTRL         */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_DEFAULT             (_FEFILT_DIGIGAINCTRL_DIGIGAIN_DEFAULT << 1)   /**< Shifted mode DEFAULT for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM3              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM3 << 1)    /**< Shifted mode GAINM3 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P75 << 1) /**< Shifted mode GAINM2P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P5 << 1)  /**< Shifted mode GAINM2P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2P25 << 1) /**< Shifted mode GAINM2P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM2 << 1)    /**< Shifted mode GAINM2 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P75 << 1) /**< Shifted mode GAINM1P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P5 << 1)  /**< Shifted mode GAINM1P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1P25 << 1) /**< Shifted mode GAINM1P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM1 << 1)    /**< Shifted mode GAINM1 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P75 << 1) /**< Shifted mode GAINM0P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P5 << 1)  /**< Shifted mode GAINM0P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0P25 << 1) /**< Shifted mode GAINM0P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINM0 << 1)    /**< Shifted mode GAINM0 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P25 << 1) /**< Shifted mode GAINP0P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P5 << 1)  /**< Shifted mode GAINP0P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP0P75 << 1) /**< Shifted mode GAINP0P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1 << 1)    /**< Shifted mode GAINP1 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P25 << 1) /**< Shifted mode GAINP1P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P5 << 1)  /**< Shifted mode GAINP1P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP1P75 << 1) /**< Shifted mode GAINP1P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2 << 1)    /**< Shifted mode GAINP2 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P25           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P25 << 1) /**< Shifted mode GAINP2P25 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P5            (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P5 << 1)  /**< Shifted mode GAINP2P5 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P75           (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP2P75 << 1) /**< Shifted mode GAINP2P75 for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP3              (_FEFILT_DIGIGAINCTRL_DIGIGAIN_GAINP3 << 1)    /**< Shifted mode GAINP3 for FEFILT_DIGIGAINCTRL */
#define FEFILT_DIGIGAINCTRL_DEC0GAIN                     (0x1UL << 9)                                   /**< DEC0 Gain Select                            */
#define _FEFILT_DIGIGAINCTRL_DEC0GAIN_SHIFT              9                                              /**< Shift value for FEFILT_DEC0GAIN             */
#define _FEFILT_DIGIGAINCTRL_DEC0GAIN_MASK               0x200UL                                        /**< Bit mask for FEFILT_DEC0GAIN                */
#define _FEFILT_DIGIGAINCTRL_DEC0GAIN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for FEFILT_DIGIGAINCTRL        */
#define FEFILT_DIGIGAINCTRL_DEC0GAIN_DEFAULT             (_FEFILT_DIGIGAINCTRL_DEC0GAIN_DEFAULT << 9)   /**< Shifted mode DEFAULT for FEFILT_DIGIGAINCTRL*/
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_SHIFT              10                                             /**< Shift value for FEFILT_DEC1GAIN             */
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_MASK               0xC00UL                                        /**< Bit mask for FEFILT_DEC1GAIN                */
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for FEFILT_DIGIGAINCTRL        */
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD0               0x00000000UL                                   /**< Mode ADD0 for FEFILT_DIGIGAINCTRL           */
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD6               0x00000001UL                                   /**< Mode ADD6 for FEFILT_DIGIGAINCTRL           */
#define _FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD12              0x00000002UL                                   /**< Mode ADD12 for FEFILT_DIGIGAINCTRL          */
#define FEFILT_DIGIGAINCTRL_DEC1GAIN_DEFAULT             (_FEFILT_DIGIGAINCTRL_DEC1GAIN_DEFAULT << 10)  /**< Shifted mode DEFAULT for FEFILT_DIGIGAINCTRL*/
#define FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD0                (_FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD0 << 10)     /**< Shifted mode ADD0 for FEFILT_DIGIGAINCTRL   */
#define FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD6                (_FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD6 << 10)     /**< Shifted mode ADD6 for FEFILT_DIGIGAINCTRL   */
#define FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD12               (_FEFILT_DIGIGAINCTRL_DEC1GAIN_ADD12 << 10)    /**< Shifted mode ADD12 for FEFILT_DIGIGAINCTRL  */
#define _FEFILT_DIGIGAINCTRL_BBSS_SHIFT                  12                                             /**< Shift value for FEFILT_BBSS                 */
#define _FEFILT_DIGIGAINCTRL_BBSS_MASK                   0xF000UL                                       /**< Bit mask for FEFILT_BBSS                    */
#define _FEFILT_DIGIGAINCTRL_BBSS_DEFAULT                0x00000000UL                                   /**< Mode DEFAULT for FEFILT_DIGIGAINCTRL        */
#define FEFILT_DIGIGAINCTRL_BBSS_DEFAULT                 (_FEFILT_DIGIGAINCTRL_BBSS_DEFAULT << 12)      /**< Shifted mode DEFAULT for FEFILT_DIGIGAINCTRL*/

/* Bit fields for FEFILT CHFCOE00 */
#define _FEFILT_CHFCOE00_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE00           */
#define _FEFILT_CHFCOE00_MASK                            0x3FFFFFFFUL                                /**< Mask for FEFILT_CHFCOE00                    */
#define _FEFILT_CHFCOE00_SET0COEFF0_SHIFT                0                                           /**< Shift value for FEFILT_SET0COEFF0           */
#define _FEFILT_CHFCOE00_SET0COEFF0_MASK                 0x3FFUL                                     /**< Bit mask for FEFILT_SET0COEFF0              */
#define _FEFILT_CHFCOE00_SET0COEFF0_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE00            */
#define FEFILT_CHFCOE00_SET0COEFF0_DEFAULT               (_FEFILT_CHFCOE00_SET0COEFF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE00    */
#define _FEFILT_CHFCOE00_SET0COEFF1_SHIFT                10                                          /**< Shift value for FEFILT_SET0COEFF1           */
#define _FEFILT_CHFCOE00_SET0COEFF1_MASK                 0xFFC00UL                                   /**< Bit mask for FEFILT_SET0COEFF1              */
#define _FEFILT_CHFCOE00_SET0COEFF1_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE00            */
#define FEFILT_CHFCOE00_SET0COEFF1_DEFAULT               (_FEFILT_CHFCOE00_SET0COEFF1_DEFAULT << 10) /**< Shifted mode DEFAULT for FEFILT_CHFCOE00    */
#define _FEFILT_CHFCOE00_SET0COEFF2_SHIFT                20                                          /**< Shift value for FEFILT_SET0COEFF2           */
#define _FEFILT_CHFCOE00_SET0COEFF2_MASK                 0x3FF00000UL                                /**< Bit mask for FEFILT_SET0COEFF2              */
#define _FEFILT_CHFCOE00_SET0COEFF2_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE00            */
#define FEFILT_CHFCOE00_SET0COEFF2_DEFAULT               (_FEFILT_CHFCOE00_SET0COEFF2_DEFAULT << 20) /**< Shifted mode DEFAULT for FEFILT_CHFCOE00    */

