SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT CHFCOE01 */
#define _FEFILT_CHFCOE01_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE01           */
#define _FEFILT_CHFCOE01_MASK                            0x003FFFFFUL                                /**< Mask for FEFILT_CHFCOE01                    */
#define _FEFILT_CHFCOE01_SET0COEFF3_SHIFT                0                                           /**< Shift value for FEFILT_SET0COEFF3           */
#define _FEFILT_CHFCOE01_SET0COEFF3_MASK                 0x7FFUL                                     /**< Bit mask for FEFILT_SET0COEFF3              */
#define _FEFILT_CHFCOE01_SET0COEFF3_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE01            */
#define FEFILT_CHFCOE01_SET0COEFF3_DEFAULT               (_FEFILT_CHFCOE01_SET0COEFF3_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE01    */
#define _FEFILT_CHFCOE01_SET0COEFF4_SHIFT                11                                          /**< Shift value for FEFILT_SET0COEFF4           */
#define _FEFILT_CHFCOE01_SET0COEFF4_MASK                 0x3FF800UL                                  /**< Bit mask for FEFILT_SET0COEFF4              */
#define _FEFILT_CHFCOE01_SET0COEFF4_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE01            */
#define FEFILT_CHFCOE01_SET0COEFF4_DEFAULT               (_FEFILT_CHFCOE01_SET0COEFF4_DEFAULT << 11) /**< Shifted mode DEFAULT for FEFILT_CHFCOE01    */

/* Bit fields for FEFILT CHFCOE02 */
#define _FEFILT_CHFCOE02_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE02           */
#define _FEFILT_CHFCOE02_MASK                            0x007FFFFFUL                                /**< Mask for FEFILT_CHFCOE02                    */
#define _FEFILT_CHFCOE02_SET0COEFF5_SHIFT                0                                           /**< Shift value for FEFILT_SET0COEFF5           */
#define _FEFILT_CHFCOE02_SET0COEFF5_MASK                 0x7FFUL                                     /**< Bit mask for FEFILT_SET0COEFF5              */
#define _FEFILT_CHFCOE02_SET0COEFF5_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE02            */
#define FEFILT_CHFCOE02_SET0COEFF5_DEFAULT               (_FEFILT_CHFCOE02_SET0COEFF5_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE02    */
#define _FEFILT_CHFCOE02_SET0COEFF6_SHIFT                11                                          /**< Shift value for FEFILT_SET0COEFF6           */
#define _FEFILT_CHFCOE02_SET0COEFF6_MASK                 0x7FF800UL                                  /**< Bit mask for FEFILT_SET0COEFF6              */
#define _FEFILT_CHFCOE02_SET0COEFF6_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE02            */
#define FEFILT_CHFCOE02_SET0COEFF6_DEFAULT               (_FEFILT_CHFCOE02_SET0COEFF6_DEFAULT << 11) /**< Shifted mode DEFAULT for FEFILT_CHFCOE02    */

/* Bit fields for FEFILT CHFCOE03 */
#define _FEFILT_CHFCOE03_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE03           */
#define _FEFILT_CHFCOE03_MASK                            0x00FFFFFFUL                                /**< Mask for FEFILT_CHFCOE03                    */
#define _FEFILT_CHFCOE03_SET0COEFF7_SHIFT                0                                           /**< Shift value for FEFILT_SET0COEFF7           */
#define _FEFILT_CHFCOE03_SET0COEFF7_MASK                 0xFFFUL                                     /**< Bit mask for FEFILT_SET0COEFF7              */
#define _FEFILT_CHFCOE03_SET0COEFF7_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE03            */
#define FEFILT_CHFCOE03_SET0COEFF7_DEFAULT               (_FEFILT_CHFCOE03_SET0COEFF7_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE03    */
#define _FEFILT_CHFCOE03_SET0COEFF8_SHIFT                12                                          /**< Shift value for FEFILT_SET0COEFF8           */
#define _FEFILT_CHFCOE03_SET0COEFF8_MASK                 0xFFF000UL                                  /**< Bit mask for FEFILT_SET0COEFF8              */
#define _FEFILT_CHFCOE03_SET0COEFF8_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE03            */
#define FEFILT_CHFCOE03_SET0COEFF8_DEFAULT               (_FEFILT_CHFCOE03_SET0COEFF8_DEFAULT << 12) /**< Shifted mode DEFAULT for FEFILT_CHFCOE03    */

/* Bit fields for FEFILT CHFCOE04 */
#define _FEFILT_CHFCOE04_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE04           */
#define _FEFILT_CHFCOE04_MASK                            0x0FFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE04                    */
#define _FEFILT_CHFCOE04_SET0COEFF9_SHIFT                0                                            /**< Shift value for FEFILT_SET0COEFF9           */
#define _FEFILT_CHFCOE04_SET0COEFF9_MASK                 0x3FFFUL                                     /**< Bit mask for FEFILT_SET0COEFF9              */
#define _FEFILT_CHFCOE04_SET0COEFF9_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE04            */
#define FEFILT_CHFCOE04_SET0COEFF9_DEFAULT               (_FEFILT_CHFCOE04_SET0COEFF9_DEFAULT << 0)   /**< Shifted mode DEFAULT for FEFILT_CHFCOE04    */
#define _FEFILT_CHFCOE04_SET0COEFF10_SHIFT               14                                           /**< Shift value for FEFILT_SET0COEFF10          */
#define _FEFILT_CHFCOE04_SET0COEFF10_MASK                0xFFFC000UL                                  /**< Bit mask for FEFILT_SET0COEFF10             */
#define _FEFILT_CHFCOE04_SET0COEFF10_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE04            */
#define FEFILT_CHFCOE04_SET0COEFF10_DEFAULT              (_FEFILT_CHFCOE04_SET0COEFF10_DEFAULT << 14) /**< Shifted mode DEFAULT for FEFILT_CHFCOE04    */

