SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT CHFCOE05 */
#define _FEFILT_CHFCOE05_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE05           */
#define _FEFILT_CHFCOE05_MASK                            0x3FFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE05                    */
#define _FEFILT_CHFCOE05_SET0COEFF11_SHIFT               0                                            /**< Shift value for FEFILT_SET0COEFF11          */
#define _FEFILT_CHFCOE05_SET0COEFF11_MASK                0x3FFFUL                                     /**< Bit mask for FEFILT_SET0COEFF11             */
#define _FEFILT_CHFCOE05_SET0COEFF11_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE05            */
#define FEFILT_CHFCOE05_SET0COEFF11_DEFAULT              (_FEFILT_CHFCOE05_SET0COEFF11_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE05    */
#define _FEFILT_CHFCOE05_SET0COEFF12_SHIFT               14                                           /**< Shift value for FEFILT_SET0COEFF12          */
#define _FEFILT_CHFCOE05_SET0COEFF12_MASK                0x3FFFC000UL                                 /**< Bit mask for FEFILT_SET0COEFF12             */
#define _FEFILT_CHFCOE05_SET0COEFF12_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE05            */
#define FEFILT_CHFCOE05_SET0COEFF12_DEFAULT              (_FEFILT_CHFCOE05_SET0COEFF12_DEFAULT << 14) /**< Shifted mode DEFAULT for FEFILT_CHFCOE05    */

/* Bit fields for FEFILT CHFCOE06 */
#define _FEFILT_CHFCOE06_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE06           */
#define _FEFILT_CHFCOE06_MASK                            0xFFFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE06                    */
#define _FEFILT_CHFCOE06_SET0COEFF13_SHIFT               0                                            /**< Shift value for FEFILT_SET0COEFF13          */
#define _FEFILT_CHFCOE06_SET0COEFF13_MASK                0xFFFFUL                                     /**< Bit mask for FEFILT_SET0COEFF13             */
#define _FEFILT_CHFCOE06_SET0COEFF13_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE06            */
#define FEFILT_CHFCOE06_SET0COEFF13_DEFAULT              (_FEFILT_CHFCOE06_SET0COEFF13_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE06    */
#define _FEFILT_CHFCOE06_SET0COEFF14_SHIFT               16                                           /**< Shift value for FEFILT_SET0COEFF14          */
#define _FEFILT_CHFCOE06_SET0COEFF14_MASK                0xFFFF0000UL                                 /**< Bit mask for FEFILT_SET0COEFF14             */
#define _FEFILT_CHFCOE06_SET0COEFF14_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE06            */
#define FEFILT_CHFCOE06_SET0COEFF14_DEFAULT              (_FEFILT_CHFCOE06_SET0COEFF14_DEFAULT << 16) /**< Shifted mode DEFAULT for FEFILT_CHFCOE06    */

/* Bit fields for FEFILT CHFCOE10 */
#define _FEFILT_CHFCOE10_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE10           */
#define _FEFILT_CHFCOE10_MASK                            0x3FFFFFFFUL                                /**< Mask for FEFILT_CHFCOE10                    */
#define _FEFILT_CHFCOE10_SET1COEFF0_SHIFT                0                                           /**< Shift value for FEFILT_SET1COEFF0           */
#define _FEFILT_CHFCOE10_SET1COEFF0_MASK                 0x3FFUL                                     /**< Bit mask for FEFILT_SET1COEFF0              */
#define _FEFILT_CHFCOE10_SET1COEFF0_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE10            */
#define FEFILT_CHFCOE10_SET1COEFF0_DEFAULT               (_FEFILT_CHFCOE10_SET1COEFF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE10    */
#define _FEFILT_CHFCOE10_SET1COEFF1_SHIFT                10                                          /**< Shift value for FEFILT_SET1COEFF1           */
#define _FEFILT_CHFCOE10_SET1COEFF1_MASK                 0xFFC00UL                                   /**< Bit mask for FEFILT_SET1COEFF1              */
#define _FEFILT_CHFCOE10_SET1COEFF1_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE10            */
#define FEFILT_CHFCOE10_SET1COEFF1_DEFAULT               (_FEFILT_CHFCOE10_SET1COEFF1_DEFAULT << 10) /**< Shifted mode DEFAULT for FEFILT_CHFCOE10    */
#define _FEFILT_CHFCOE10_SET1COEFF2_SHIFT                20                                          /**< Shift value for FEFILT_SET1COEFF2           */
#define _FEFILT_CHFCOE10_SET1COEFF2_MASK                 0x3FF00000UL                                /**< Bit mask for FEFILT_SET1COEFF2              */
#define _FEFILT_CHFCOE10_SET1COEFF2_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE10            */
#define FEFILT_CHFCOE10_SET1COEFF2_DEFAULT               (_FEFILT_CHFCOE10_SET1COEFF2_DEFAULT << 20) /**< Shifted mode DEFAULT for FEFILT_CHFCOE10    */

/* Bit fields for FEFILT CHFCOE11 */
#define _FEFILT_CHFCOE11_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE11           */
#define _FEFILT_CHFCOE11_MASK                            0x003FFFFFUL                                /**< Mask for FEFILT_CHFCOE11                    */
#define _FEFILT_CHFCOE11_SET1COEFF3_SHIFT                0                                           /**< Shift value for FEFILT_SET1COEFF3           */
#define _FEFILT_CHFCOE11_SET1COEFF3_MASK                 0x7FFUL                                     /**< Bit mask for FEFILT_SET1COEFF3              */
#define _FEFILT_CHFCOE11_SET1COEFF3_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE11            */
#define FEFILT_CHFCOE11_SET1COEFF3_DEFAULT               (_FEFILT_CHFCOE11_SET1COEFF3_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE11    */
#define _FEFILT_CHFCOE11_SET1COEFF4_SHIFT                11                                          /**< Shift value for FEFILT_SET1COEFF4           */
#define _FEFILT_CHFCOE11_SET1COEFF4_MASK                 0x3FF800UL                                  /**< Bit mask for FEFILT_SET1COEFF4              */
#define _FEFILT_CHFCOE11_SET1COEFF4_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE11            */
#define FEFILT_CHFCOE11_SET1COEFF4_DEFAULT               (_FEFILT_CHFCOE11_SET1COEFF4_DEFAULT << 11) /**< Shifted mode DEFAULT for FEFILT_CHFCOE11    */

/* Bit fields for FEFILT CHFCOE12 */
#define _FEFILT_CHFCOE12_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE12           */
#define _FEFILT_CHFCOE12_MASK                            0x007FFFFFUL                                /**< Mask for FEFILT_CHFCOE12                    */
#define _FEFILT_CHFCOE12_SET1COEFF5_SHIFT                0                                           /**< Shift value for FEFILT_SET1COEFF5           */
#define _FEFILT_CHFCOE12_SET1COEFF5_MASK                 0x7FFUL                                     /**< Bit mask for FEFILT_SET1COEFF5              */
#define _FEFILT_CHFCOE12_SET1COEFF5_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE12            */
#define FEFILT_CHFCOE12_SET1COEFF5_DEFAULT               (_FEFILT_CHFCOE12_SET1COEFF5_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE12    */
#define _FEFILT_CHFCOE12_SET1COEFF6_SHIFT                11                                          /**< Shift value for FEFILT_SET1COEFF6           */
#define _FEFILT_CHFCOE12_SET1COEFF6_MASK                 0x7FF800UL                                  /**< Bit mask for FEFILT_SET1COEFF6              */
#define _FEFILT_CHFCOE12_SET1COEFF6_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE12            */
#define FEFILT_CHFCOE12_SET1COEFF6_DEFAULT               (_FEFILT_CHFCOE12_SET1COEFF6_DEFAULT << 11) /**< Shifted mode DEFAULT for FEFILT_CHFCOE12    */

