SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT CHFCOE13 */
#define _FEFILT_CHFCOE13_RESETVALUE                      0x00000000UL                                /**< Default value for FEFILT_CHFCOE13           */
#define _FEFILT_CHFCOE13_MASK                            0x00FFFFFFUL                                /**< Mask for FEFILT_CHFCOE13                    */
#define _FEFILT_CHFCOE13_SET1COEFF7_SHIFT                0                                           /**< Shift value for FEFILT_SET1COEFF7           */
#define _FEFILT_CHFCOE13_SET1COEFF7_MASK                 0xFFFUL                                     /**< Bit mask for FEFILT_SET1COEFF7              */
#define _FEFILT_CHFCOE13_SET1COEFF7_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE13            */
#define FEFILT_CHFCOE13_SET1COEFF7_DEFAULT               (_FEFILT_CHFCOE13_SET1COEFF7_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE13    */
#define _FEFILT_CHFCOE13_SET1COEFF8_SHIFT                12                                          /**< Shift value for FEFILT_SET1COEFF8           */
#define _FEFILT_CHFCOE13_SET1COEFF8_MASK                 0xFFF000UL                                  /**< Bit mask for FEFILT_SET1COEFF8              */
#define _FEFILT_CHFCOE13_SET1COEFF8_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for FEFILT_CHFCOE13            */
#define FEFILT_CHFCOE13_SET1COEFF8_DEFAULT               (_FEFILT_CHFCOE13_SET1COEFF8_DEFAULT << 12) /**< Shifted mode DEFAULT for FEFILT_CHFCOE13    */

/* Bit fields for FEFILT CHFCOE15 */
#define _FEFILT_CHFCOE15_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE15           */
#define _FEFILT_CHFCOE15_MASK                            0x3FFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE15                    */
#define _FEFILT_CHFCOE15_SET1COEFF11_SHIFT               0                                            /**< Shift value for FEFILT_SET1COEFF11          */
#define _FEFILT_CHFCOE15_SET1COEFF11_MASK                0x3FFFUL                                     /**< Bit mask for FEFILT_SET1COEFF11             */
#define _FEFILT_CHFCOE15_SET1COEFF11_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE15            */
#define FEFILT_CHFCOE15_SET1COEFF11_DEFAULT              (_FEFILT_CHFCOE15_SET1COEFF11_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE15    */
#define _FEFILT_CHFCOE15_SET1COEFF12_SHIFT               14                                           /**< Shift value for FEFILT_SET1COEFF12          */
#define _FEFILT_CHFCOE15_SET1COEFF12_MASK                0x3FFFC000UL                                 /**< Bit mask for FEFILT_SET1COEFF12             */
#define _FEFILT_CHFCOE15_SET1COEFF12_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE15            */
#define FEFILT_CHFCOE15_SET1COEFF12_DEFAULT              (_FEFILT_CHFCOE15_SET1COEFF12_DEFAULT << 14) /**< Shifted mode DEFAULT for FEFILT_CHFCOE15    */

/* Bit fields for FEFILT CHFCOE14 */
#define _FEFILT_CHFCOE14_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE14           */
#define _FEFILT_CHFCOE14_MASK                            0x0FFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE14                    */
#define _FEFILT_CHFCOE14_SET1COEFF9_SHIFT                0                                            /**< Shift value for FEFILT_SET1COEFF9           */
#define _FEFILT_CHFCOE14_SET1COEFF9_MASK                 0x3FFFUL                                     /**< Bit mask for FEFILT_SET1COEFF9              */
#define _FEFILT_CHFCOE14_SET1COEFF9_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE14            */
#define FEFILT_CHFCOE14_SET1COEFF9_DEFAULT               (_FEFILT_CHFCOE14_SET1COEFF9_DEFAULT << 0)   /**< Shifted mode DEFAULT for FEFILT_CHFCOE14    */
#define _FEFILT_CHFCOE14_SET1COEFF10_SHIFT               14                                           /**< Shift value for FEFILT_SET1COEFF10          */
#define _FEFILT_CHFCOE14_SET1COEFF10_MASK                0xFFFC000UL                                  /**< Bit mask for FEFILT_SET1COEFF10             */
#define _FEFILT_CHFCOE14_SET1COEFF10_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE14            */
#define FEFILT_CHFCOE14_SET1COEFF10_DEFAULT              (_FEFILT_CHFCOE14_SET1COEFF10_DEFAULT << 14) /**< Shifted mode DEFAULT for FEFILT_CHFCOE14    */

/* Bit fields for FEFILT CHFCOE16 */
#define _FEFILT_CHFCOE16_RESETVALUE                      0x00000000UL                                 /**< Default value for FEFILT_CHFCOE16           */
#define _FEFILT_CHFCOE16_MASK                            0xFFFFFFFFUL                                 /**< Mask for FEFILT_CHFCOE16                    */
#define _FEFILT_CHFCOE16_SET1COEFF13_SHIFT               0                                            /**< Shift value for FEFILT_SET1COEFF13          */
#define _FEFILT_CHFCOE16_SET1COEFF13_MASK                0xFFFFUL                                     /**< Bit mask for FEFILT_SET1COEFF13             */
#define _FEFILT_CHFCOE16_SET1COEFF13_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE16            */
#define FEFILT_CHFCOE16_SET1COEFF13_DEFAULT              (_FEFILT_CHFCOE16_SET1COEFF13_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_CHFCOE16    */
#define _FEFILT_CHFCOE16_SET1COEFF14_SHIFT               16                                           /**< Shift value for FEFILT_SET1COEFF14          */
#define _FEFILT_CHFCOE16_SET1COEFF14_MASK                0xFFFF0000UL                                 /**< Bit mask for FEFILT_SET1COEFF14             */
#define _FEFILT_CHFCOE16_SET1COEFF14_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for FEFILT_CHFCOE16            */
#define FEFILT_CHFCOE16_SET1COEFF14_DEFAULT              (_FEFILT_CHFCOE16_SET1COEFF14_DEFAULT << 16) /**< Shifted mode DEFAULT for FEFILT_CHFCOE16    */

/* Bit fields for FEFILT CHFCTRL */
#define _FEFILT_CHFCTRL_RESETVALUE                       0x00000000UL                                     /**< Default value for FEFILT_CHFCTRL            */
#define _FEFILT_CHFCTRL_MASK                             0xC000000FUL                                     /**< Mask for FEFILT_CHFCTRL                     */
#define FEFILT_CHFCTRL_FWSWCOEFFEN                       (0x1UL << 0)                                     /**< FW Switch CHF COE. Enable                   */
#define _FEFILT_CHFCTRL_FWSWCOEFFEN_SHIFT                0                                                /**< Shift value for FEFILT_FWSWCOEFFEN          */
#define _FEFILT_CHFCTRL_FWSWCOEFFEN_MASK                 0x1UL                                            /**< Bit mask for FEFILT_FWSWCOEFFEN             */
#define _FEFILT_CHFCTRL_FWSWCOEFFEN_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for FEFILT_CHFCTRL             */
#define FEFILT_CHFCTRL_FWSWCOEFFEN_DEFAULT               (_FEFILT_CHFCTRL_FWSWCOEFFEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for FEFILT_CHFCTRL     */
#define FEFILT_CHFCTRL_FWSELCOEFF                        (0x1UL << 1)                                     /**< FW Select CHF COE. set                      */
#define _FEFILT_CHFCTRL_FWSELCOEFF_SHIFT                 1                                                /**< Shift value for FEFILT_FWSELCOEFF           */
#define _FEFILT_CHFCTRL_FWSELCOEFF_MASK                  0x2UL                                            /**< Bit mask for FEFILT_FWSELCOEFF              */
#define _FEFILT_CHFCTRL_FWSELCOEFF_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for FEFILT_CHFCTRL             */
#define FEFILT_CHFCTRL_FWSELCOEFF_DEFAULT                (_FEFILT_CHFCTRL_FWSELCOEFF_DEFAULT << 1)        /**< Shifted mode DEFAULT for FEFILT_CHFCTRL     */
#define _FEFILT_CHFCTRL_CHFLATENCY_SHIFT                 2                                                /**< Shift value for FEFILT_CHFLATENCY           */
#define _FEFILT_CHFCTRL_CHFLATENCY_MASK                  0xCUL                                            /**< Bit mask for FEFILT_CHFLATENCY              */
#define _FEFILT_CHFCTRL_CHFLATENCY_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for FEFILT_CHFCTRL             */
#define FEFILT_CHFCTRL_CHFLATENCY_DEFAULT                (_FEFILT_CHFCTRL_CHFLATENCY_DEFAULT << 2)        /**< Shifted mode DEFAULT for FEFILT_CHFCTRL     */
#define FEFILT_CHFCTRL_SWCOEFFSELECTION                  (0x1UL << 30)                                    /**< Switch CHF COE. Selection                   */
#define _FEFILT_CHFCTRL_SWCOEFFSELECTION_SHIFT           30                                               /**< Shift value for FEFILT_SWCOEFFSELECTION     */
#define _FEFILT_CHFCTRL_SWCOEFFSELECTION_MASK            0x40000000UL                                     /**< Bit mask for FEFILT_SWCOEFFSELECTION        */
#define _FEFILT_CHFCTRL_SWCOEFFSELECTION_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for FEFILT_CHFCTRL             */
#define FEFILT_CHFCTRL_SWCOEFFSELECTION_DEFAULT          (_FEFILT_CHFCTRL_SWCOEFFSELECTION_DEFAULT << 30) /**< Shifted mode DEFAULT for FEFILT_CHFCTRL     */
#define FEFILT_CHFCTRL_SWCOEFFEN                         (0x1UL << 31)                                    /**< Switch CHF COE. Enable                      */
#define _FEFILT_CHFCTRL_SWCOEFFEN_SHIFT                  31                                               /**< Shift value for FEFILT_SWCOEFFEN            */
#define _FEFILT_CHFCTRL_SWCOEFFEN_MASK                   0x80000000UL                                     /**< Bit mask for FEFILT_SWCOEFFEN               */
#define _FEFILT_CHFCTRL_SWCOEFFEN_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for FEFILT_CHFCTRL             */
#define FEFILT_CHFCTRL_SWCOEFFEN_DEFAULT                 (_FEFILT_CHFCTRL_SWCOEFFEN_DEFAULT << 31)        /**< Shifted mode DEFAULT for FEFILT_CHFCTRL     */

