SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT CTRL */
#define _FEFILT_CTRL_RESETVALUE                          0x00000000UL                           /**< Default value for FEFILT_CTRL               */
#define _FEFILT_CTRL_MASK                                0x0007FFFFUL                           /**< Mask for FEFILT_CTRL                        */
#define _FEFILT_CTRL_SWAFCADJRX_SHIFT                    0                                      /**< Shift value for FEFILT_SWAFCADJRX           */
#define _FEFILT_CTRL_SWAFCADJRX_MASK                     0x7FFFFUL                              /**< Bit mask for FEFILT_SWAFCADJRX              */
#define _FEFILT_CTRL_SWAFCADJRX_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for FEFILT_CTRL                */
#define FEFILT_CTRL_SWAFCADJRX_DEFAULT                   (_FEFILT_CTRL_SWAFCADJRX_DEFAULT << 0) /**< Shifted mode DEFAULT for FEFILT_CTRL        */

/* Bit fields for FEFILT BLANKING */
#define _FEFILT_BLANKING_RESETVALUE                      0x00000000UL                                  /**< Default value for FEFILT_BLANKING           */
#define _FEFILT_BLANKING_MASK                            0x0007FFFFUL                                  /**< Mask for FEFILT_BLANKING                    */
#define _FEFILT_BLANKING_BLANKDELAY_SHIFT                0                                             /**< Shift value for FEFILT_BLANKDELAY           */
#define _FEFILT_BLANKING_BLANKDELAY_MASK                 0xFFUL                                        /**< Bit mask for FEFILT_BLANKDELAY              */
#define _FEFILT_BLANKING_BLANKDELAY_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for FEFILT_BLANKING            */
#define FEFILT_BLANKING_BLANKDELAY_DEFAULT               (_FEFILT_BLANKING_BLANKDELAY_DEFAULT << 0)    /**< Shifted mode DEFAULT for FEFILT_BLANKING    */
#define _FEFILT_BLANKING_BLANKDURATION_SHIFT             8                                             /**< Shift value for FEFILT_BLANKDURATION        */
#define _FEFILT_BLANKING_BLANKDURATION_MASK              0xFF00UL                                      /**< Bit mask for FEFILT_BLANKDURATION           */
#define _FEFILT_BLANKING_BLANKDURATION_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for FEFILT_BLANKING            */
#define FEFILT_BLANKING_BLANKDURATION_DEFAULT            (_FEFILT_BLANKING_BLANKDURATION_DEFAULT << 8) /**< Shifted mode DEFAULT for FEFILT_BLANKING    */
#define _FEFILT_BLANKING_BLANKMODE_SHIFT                 16                                            /**< Shift value for FEFILT_BLANKMODE            */
#define _FEFILT_BLANKING_BLANKMODE_MASK                  0x70000UL                                     /**< Bit mask for FEFILT_BLANKMODE               */
#define _FEFILT_BLANKING_BLANKMODE_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for FEFILT_BLANKING            */
#define _FEFILT_BLANKING_BLANKMODE_OFF                   0x00000000UL                                  /**< Mode OFF for FEFILT_BLANKING                */
#define _FEFILT_BLANKING_BLANKMODE_FORCE_IQ              0x00000001UL                                  /**< Mode FORCE_IQ for FEFILT_BLANKING           */
#define _FEFILT_BLANKING_BLANKMODE_FORCE_I               0x00000002UL                                  /**< Mode FORCE_I for FEFILT_BLANKING            */
#define _FEFILT_BLANKING_BLANKMODE_FORCE_Q               0x00000003UL                                  /**< Mode FORCE_Q for FEFILT_BLANKING            */
#define _FEFILT_BLANKING_BLANKMODE_AUTO                  0x00000004UL                                  /**< Mode AUTO for FEFILT_BLANKING               */
#define FEFILT_BLANKING_BLANKMODE_DEFAULT                (_FEFILT_BLANKING_BLANKMODE_DEFAULT << 16)    /**< Shifted mode DEFAULT for FEFILT_BLANKING    */
#define FEFILT_BLANKING_BLANKMODE_OFF                    (_FEFILT_BLANKING_BLANKMODE_OFF << 16)        /**< Shifted mode OFF for FEFILT_BLANKING        */
#define FEFILT_BLANKING_BLANKMODE_FORCE_IQ               (_FEFILT_BLANKING_BLANKMODE_FORCE_IQ << 16)   /**< Shifted mode FORCE_IQ for FEFILT_BLANKING   */
#define FEFILT_BLANKING_BLANKMODE_FORCE_I                (_FEFILT_BLANKING_BLANKMODE_FORCE_I << 16)    /**< Shifted mode FORCE_I for FEFILT_BLANKING    */
#define FEFILT_BLANKING_BLANKMODE_FORCE_Q                (_FEFILT_BLANKING_BLANKMODE_FORCE_Q << 16)    /**< Shifted mode FORCE_Q for FEFILT_BLANKING    */
#define FEFILT_BLANKING_BLANKMODE_AUTO                   (_FEFILT_BLANKING_BLANKMODE_AUTO << 16)       /**< Shifted mode AUTO for FEFILT_BLANKING       */

/* Bit fields for FEFILT RSSIFILT */
#define _FEFILT_RSSIFILT_RESETVALUE                      0x00000000UL                                   /**< Default value for FEFILT_RSSIFILT           */
#define _FEFILT_RSSIFILT_MASK                            0x001FFFFFUL                                   /**< Mask for FEFILT_RSSIFILT                    */
#define FEFILT_RSSIFILT_RSSIFILTEN                       (0x1UL << 0)                                   /**< New BitField                                */
#define _FEFILT_RSSIFILT_RSSIFILTEN_SHIFT                0                                              /**< Shift value for FEFILT_RSSIFILTEN           */
#define _FEFILT_RSSIFILT_RSSIFILTEN_MASK                 0x1UL                                          /**< Bit mask for FEFILT_RSSIFILTEN              */
#define _FEFILT_RSSIFILT_RSSIFILTEN_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTEN_DEFAULT               (_FEFILT_RSSIFILT_RSSIFILTEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define FEFILT_RSSIFILT_RSSIFILTDEC                      (0x1UL << 1)                                   /**< New BitField                                */
#define _FEFILT_RSSIFILT_RSSIFILTDEC_SHIFT               1                                              /**< Shift value for FEFILT_RSSIFILTDEC          */
#define _FEFILT_RSSIFILT_RSSIFILTDEC_MASK                0x2UL                                          /**< Bit mask for FEFILT_RSSIFILTDEC             */
#define _FEFILT_RSSIFILT_RSSIFILTDEC_DEFAULT             0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTDEC_DEFAULT              (_FEFILT_RSSIFILT_RSSIFILTDEC_DEFAULT << 1)    /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTGAIN_SHIFT              2                                              /**< Shift value for FEFILT_RSSIFILTGAIN         */
#define _FEFILT_RSSIFILT_RSSIFILTGAIN_MASK               0x1CUL                                         /**< Bit mask for FEFILT_RSSIFILTGAIN            */
#define _FEFILT_RSSIFILT_RSSIFILTGAIN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTGAIN_DEFAULT             (_FEFILT_RSSIFILT_RSSIFILTGAIN_DEFAULT << 2)   /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF0_SHIFT             5                                              /**< Shift value for FEFILT_RSSIFILTCOEF0        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF0_MASK              0x60UL                                         /**< Bit mask for FEFILT_RSSIFILTCOEF0           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF0_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF0_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF0_DEFAULT << 5)  /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF1_SHIFT             7                                              /**< Shift value for FEFILT_RSSIFILTCOEF1        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF1_MASK              0x180UL                                        /**< Bit mask for FEFILT_RSSIFILTCOEF1           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF1_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF1_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF1_DEFAULT << 7)  /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF2_SHIFT             9                                              /**< Shift value for FEFILT_RSSIFILTCOEF2        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF2_MASK              0x600UL                                        /**< Bit mask for FEFILT_RSSIFILTCOEF2           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF2_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF2_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF2_DEFAULT << 9)  /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF3_SHIFT             11                                             /**< Shift value for FEFILT_RSSIFILTCOEF3        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF3_MASK              0x1800UL                                       /**< Bit mask for FEFILT_RSSIFILTCOEF3           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF3_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF3_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF3_DEFAULT << 11) /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF4_SHIFT             13                                             /**< Shift value for FEFILT_RSSIFILTCOEF4        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF4_MASK              0x6000UL                                       /**< Bit mask for FEFILT_RSSIFILTCOEF4           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF4_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF4_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF4_DEFAULT << 13) /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF5_SHIFT             15                                             /**< Shift value for FEFILT_RSSIFILTCOEF5        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF5_MASK              0x18000UL                                      /**< Bit mask for FEFILT_RSSIFILTCOEF5           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF5_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF5_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF5_DEFAULT << 15) /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF6_SHIFT             17                                             /**< Shift value for FEFILT_RSSIFILTCOEF6        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF6_MASK              0x60000UL                                      /**< Bit mask for FEFILT_RSSIFILTCOEF6           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF6_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF6_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF6_DEFAULT << 17) /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF7_SHIFT             19                                             /**< Shift value for FEFILT_RSSIFILTCOEF7        */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF7_MASK              0x180000UL                                     /**< Bit mask for FEFILT_RSSIFILTCOEF7           */
#define _FEFILT_RSSIFILT_RSSIFILTCOEF7_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for FEFILT_RSSIFILT            */
#define FEFILT_RSSIFILT_RSSIFILTCOEF7_DEFAULT            (_FEFILT_RSSIFILT_RSSIFILTCOEF7_DEFAULT << 19) /**< Shifted mode DEFAULT for FEFILT_RSSIFILT    */

/* Bit fields for FEFILT DIGMIXCTRL */
#define _FEFILT_DIGMIXCTRL_RESETVALUE                    0x00000000UL                                      /**< Default value for FEFILT_DIGMIXCTRL         */
#define _FEFILT_DIGMIXCTRL_MASK                          0x007FFFFFUL                                      /**< Mask for FEFILT_DIGMIXCTRL                  */
#define _FEFILT_DIGMIXCTRL_DIGMIXFREQ_SHIFT              0                                                 /**< Shift value for FEFILT_DIGMIXFREQ           */
#define _FEFILT_DIGMIXCTRL_DIGMIXFREQ_MASK               0xFFFFFUL                                         /**< Bit mask for FEFILT_DIGMIXFREQ              */
#define _FEFILT_DIGMIXCTRL_DIGMIXFREQ_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for FEFILT_DIGMIXCTRL          */
#define FEFILT_DIGMIXCTRL_DIGMIXFREQ_DEFAULT             (_FEFILT_DIGMIXCTRL_DIGMIXFREQ_DEFAULT << 0)      /**< Shifted mode DEFAULT for FEFILT_DIGMIXCTRL  */
#define FEFILT_DIGMIXCTRL_DIGIQSWAPEN                    (0x1UL << 20)                                     /**< Digital I/Q swap enable                     */
#define _FEFILT_DIGMIXCTRL_DIGIQSWAPEN_SHIFT             20                                                /**< Shift value for FEFILT_DIGIQSWAPEN          */
#define _FEFILT_DIGMIXCTRL_DIGIQSWAPEN_MASK              0x100000UL                                        /**< Bit mask for FEFILT_DIGIQSWAPEN             */
#define _FEFILT_DIGMIXCTRL_DIGIQSWAPEN_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for FEFILT_DIGMIXCTRL          */
#define FEFILT_DIGMIXCTRL_DIGIQSWAPEN_DEFAULT            (_FEFILT_DIGMIXCTRL_DIGIQSWAPEN_DEFAULT << 20)    /**< Shifted mode DEFAULT for FEFILT_DIGMIXCTRL  */
#define FEFILT_DIGMIXCTRL_MIXERCONJ                      (0x1UL << 21)                                     /**< Digital mixer input conjugate               */
#define _FEFILT_DIGMIXCTRL_MIXERCONJ_SHIFT               21                                                /**< Shift value for FEFILT_MIXERCONJ            */
#define _FEFILT_DIGMIXCTRL_MIXERCONJ_MASK                0x200000UL                                        /**< Bit mask for FEFILT_MIXERCONJ               */
#define _FEFILT_DIGMIXCTRL_MIXERCONJ_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for FEFILT_DIGMIXCTRL          */
#define FEFILT_DIGMIXCTRL_MIXERCONJ_DEFAULT              (_FEFILT_DIGMIXCTRL_MIXERCONJ_DEFAULT << 21)      /**< Shifted mode DEFAULT for FEFILT_DIGMIXCTRL  */
#define FEFILT_DIGMIXCTRL_DIGMIXFBENABLE                 (0x1UL << 22)                                     /**< Digital mixer Frequency Correction          */
#define _FEFILT_DIGMIXCTRL_DIGMIXFBENABLE_SHIFT          22                                                /**< Shift value for FEFILT_DIGMIXFBENABLE       */
#define _FEFILT_DIGMIXCTRL_DIGMIXFBENABLE_MASK           0x400000UL                                        /**< Bit mask for FEFILT_DIGMIXFBENABLE          */
#define _FEFILT_DIGMIXCTRL_DIGMIXFBENABLE_DEFAULT        0x00000000UL                                      /**< Mode DEFAULT for FEFILT_DIGMIXCTRL          */
#define FEFILT_DIGMIXCTRL_DIGMIXFBENABLE_DEFAULT         (_FEFILT_DIGMIXCTRL_DIGMIXFBENABLE_DEFAULT << 22) /**< Shifted mode DEFAULT for FEFILT_DIGMIXCTRL  */

