SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT DCCOMP */
#define _FEFILT_DCCOMP_RESETVALUE                        0x00000030UL                                     /**< Default value for FEFILT_DCCOMP             */
#define _FEFILT_DCCOMP_MASK                              0x01FFFFFFUL                                     /**< Mask for FEFILT_DCCOMP                      */
#define FEFILT_DCCOMP_DCESTIEN                           (0x1UL << 0)                                     /**< DC Offset Estimation Enable                 */
#define _FEFILT_DCCOMP_DCESTIEN_SHIFT                    0                                                /**< Shift value for FEFILT_DCESTIEN             */
#define _FEFILT_DCCOMP_DCESTIEN_MASK                     0x1UL                                            /**< Bit mask for FEFILT_DCESTIEN                */
#define _FEFILT_DCCOMP_DCESTIEN_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCESTIEN_DEFAULT                   (_FEFILT_DCCOMP_DCESTIEN_DEFAULT << 0)           /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_DCCOMPEN                           (0x1UL << 1)                                     /**< DC Offset Compensation Enable               */
#define _FEFILT_DCCOMP_DCCOMPEN_SHIFT                    1                                                /**< Shift value for FEFILT_DCCOMPEN             */
#define _FEFILT_DCCOMP_DCCOMPEN_MASK                     0x2UL                                            /**< Bit mask for FEFILT_DCCOMPEN                */
#define _FEFILT_DCCOMP_DCCOMPEN_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCCOMPEN_DEFAULT                   (_FEFILT_DCCOMP_DCCOMPEN_DEFAULT << 1)           /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_DCRSTEN                            (0x1UL << 2)                                     /**< DC Compensation Filter Reset Enable         */
#define _FEFILT_DCCOMP_DCRSTEN_SHIFT                     2                                                /**< Shift value for FEFILT_DCRSTEN              */
#define _FEFILT_DCCOMP_DCRSTEN_MASK                      0x4UL                                            /**< Bit mask for FEFILT_DCRSTEN                 */
#define _FEFILT_DCCOMP_DCRSTEN_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCRSTEN_DEFAULT                    (_FEFILT_DCCOMP_DCRSTEN_DEFAULT << 2)            /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_DCCOMPFREEZE                       (0x1UL << 3)                                     /**< DC Offset Compensation Filter Freeze        */
#define _FEFILT_DCCOMP_DCCOMPFREEZE_SHIFT                3                                                /**< Shift value for FEFILT_DCCOMPFREEZE         */
#define _FEFILT_DCCOMP_DCCOMPFREEZE_MASK                 0x8UL                                            /**< Bit mask for FEFILT_DCCOMPFREEZE            */
#define _FEFILT_DCCOMP_DCCOMPFREEZE_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCCOMPFREEZE_DEFAULT               (_FEFILT_DCCOMP_DCCOMPFREEZE_DEFAULT << 3)       /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define _FEFILT_DCCOMP_DCCOMPGEAR_SHIFT                  4                                                /**< Shift value for FEFILT_DCCOMPGEAR           */
#define _FEFILT_DCCOMP_DCCOMPGEAR_MASK                   0xF0UL                                           /**< Bit mask for FEFILT_DCCOMPGEAR              */
#define _FEFILT_DCCOMP_DCCOMPGEAR_DEFAULT                0x00000003UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCCOMPGEAR_DEFAULT                 (_FEFILT_DCCOMP_DCCOMPGEAR_DEFAULT << 4)         /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define _FEFILT_DCCOMP_DCLIMIT_SHIFT                     8                                                /**< Shift value for FEFILT_DCLIMIT              */
#define _FEFILT_DCCOMP_DCLIMIT_MASK                      0x300UL                                          /**< Bit mask for FEFILT_DCLIMIT                 */
#define _FEFILT_DCCOMP_DCLIMIT_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define _FEFILT_DCCOMP_DCLIMIT_FULLSCALE                 0x00000000UL                                     /**< Mode FULLSCALE for FEFILT_DCCOMP            */
#define _FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY4              0x00000001UL                                     /**< Mode FULLSCALEBY4 for FEFILT_DCCOMP         */
#define _FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY8              0x00000002UL                                     /**< Mode FULLSCALEBY8 for FEFILT_DCCOMP         */
#define _FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY16             0x00000003UL                                     /**< Mode FULLSCALEBY16 for FEFILT_DCCOMP        */
#define FEFILT_DCCOMP_DCLIMIT_DEFAULT                    (_FEFILT_DCCOMP_DCLIMIT_DEFAULT << 8)            /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_DCLIMIT_FULLSCALE                  (_FEFILT_DCCOMP_DCLIMIT_FULLSCALE << 8)          /**< Shifted mode FULLSCALE for FEFILT_DCCOMP    */
#define FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY4               (_FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY4 << 8)       /**< Shifted mode FULLSCALEBY4 for FEFILT_DCCOMP */
#define FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY8               (_FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY8 << 8)       /**< Shifted mode FULLSCALEBY8 for FEFILT_DCCOMP */
#define FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY16              (_FEFILT_DCCOMP_DCLIMIT_FULLSCALEBY16 << 8)      /**< Shifted mode FULLSCALEBY16 for FEFILT_DCCOMP*/
#define FEFILT_DCCOMP_DCGAINGEAREN                       (0x1UL << 10)                                    /**< DC Offset Gain Change Filter Gear Enable    */
#define _FEFILT_DCCOMP_DCGAINGEAREN_SHIFT                10                                               /**< Shift value for FEFILT_DCGAINGEAREN         */
#define _FEFILT_DCCOMP_DCGAINGEAREN_MASK                 0x400UL                                          /**< Bit mask for FEFILT_DCGAINGEAREN            */
#define _FEFILT_DCCOMP_DCGAINGEAREN_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCGAINGEAREN_DEFAULT               (_FEFILT_DCCOMP_DCGAINGEAREN_DEFAULT << 10)      /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define _FEFILT_DCCOMP_DCGAINGEAR_SHIFT                  11                                               /**< Shift value for FEFILT_DCGAINGEAR           */
#define _FEFILT_DCCOMP_DCGAINGEAR_MASK                   0x7800UL                                         /**< Bit mask for FEFILT_DCGAINGEAR              */
#define _FEFILT_DCCOMP_DCGAINGEAR_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCGAINGEAR_DEFAULT                 (_FEFILT_DCCOMP_DCGAINGEAR_DEFAULT << 11)        /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define _FEFILT_DCCOMP_DCGAINGEARSMPS_SHIFT              15                                               /**< Shift value for FEFILT_DCGAINGEARSMPS       */
#define _FEFILT_DCCOMP_DCGAINGEARSMPS_MASK               0x7F8000UL                                       /**< Bit mask for FEFILT_DCGAINGEARSMPS          */
#define _FEFILT_DCCOMP_DCGAINGEARSMPS_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define FEFILT_DCCOMP_DCGAINGEARSMPS_DEFAULT             (_FEFILT_DCCOMP_DCGAINGEARSMPS_DEFAULT << 15)    /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_GEARGAINCHANGESEL                  (0x1UL << 23)                                    /**< DC Offset Gain Change Request Selection     */
#define _FEFILT_DCCOMP_GEARGAINCHANGESEL_SHIFT           23                                               /**< Shift value for FEFILT_GEARGAINCHANGESEL    */
#define _FEFILT_DCCOMP_GEARGAINCHANGESEL_MASK            0x800000UL                                       /**< Bit mask for FEFILT_GEARGAINCHANGESEL       */
#define _FEFILT_DCCOMP_GEARGAINCHANGESEL_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define _FEFILT_DCCOMP_GEARGAINCHANGESEL_AGC             0x00000000UL                                     /**< Mode AGC for FEFILT_DCCOMP                  */
#define _FEFILT_DCCOMP_GEARGAINCHANGESEL_SW              0x00000001UL                                     /**< Mode SW for FEFILT_DCCOMP                   */
#define FEFILT_DCCOMP_GEARGAINCHANGESEL_DEFAULT          (_FEFILT_DCCOMP_GEARGAINCHANGESEL_DEFAULT << 23) /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_GEARGAINCHANGESEL_AGC              (_FEFILT_DCCOMP_GEARGAINCHANGESEL_AGC << 23)     /**< Shifted mode AGC for FEFILT_DCCOMP          */
#define FEFILT_DCCOMP_GEARGAINCHANGESEL_SW               (_FEFILT_DCCOMP_GEARGAINCHANGESEL_SW << 23)      /**< Shifted mode SW for FEFILT_DCCOMP           */
#define FEFILT_DCCOMP_GEARFREEZEENABLE                   (0x1UL << 24)                                    /**< DC Offset freeze enable for DC Gear         */
#define _FEFILT_DCCOMP_GEARFREEZEENABLE_SHIFT            24                                               /**< Shift value for FEFILT_GEARFREEZEENABLE     */
#define _FEFILT_DCCOMP_GEARFREEZEENABLE_MASK             0x1000000UL                                      /**< Bit mask for FEFILT_GEARFREEZEENABLE        */
#define _FEFILT_DCCOMP_GEARFREEZEENABLE_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for FEFILT_DCCOMP              */
#define _FEFILT_DCCOMP_GEARFREEZEENABLE_DISABLE          0x00000000UL                                     /**< Mode DISABLE for FEFILT_DCCOMP              */
#define _FEFILT_DCCOMP_GEARFREEZEENABLE_ENABLE           0x00000001UL                                     /**< Mode ENABLE for FEFILT_DCCOMP               */
#define FEFILT_DCCOMP_GEARFREEZEENABLE_DEFAULT           (_FEFILT_DCCOMP_GEARFREEZEENABLE_DEFAULT << 24)  /**< Shifted mode DEFAULT for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_GEARFREEZEENABLE_DISABLE           (_FEFILT_DCCOMP_GEARFREEZEENABLE_DISABLE << 24)  /**< Shifted mode DISABLE for FEFILT_DCCOMP      */
#define FEFILT_DCCOMP_GEARFREEZEENABLE_ENABLE            (_FEFILT_DCCOMP_GEARFREEZEENABLE_ENABLE << 24)   /**< Shifted mode ENABLE for FEFILT_DCCOMP       */

/* Bit fields for FEFILT DCCOMPFILTINIT */
#define _FEFILT_DCCOMPFILTINIT_RESETVALUE                0x00000000UL                                          /**< Default value for FEFILT_DCCOMPFILTINIT     */
#define _FEFILT_DCCOMPFILTINIT_MASK                      0x7FFFFFFFUL                                          /**< Mask for FEFILT_DCCOMPFILTINIT              */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALI_SHIFT      0                                                     /**< Shift value for FEFILT_DCCOMPINITVALI       */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALI_MASK       0x7FFFUL                                              /**< Bit mask for FEFILT_DCCOMPINITVALI          */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT    0x00000000UL                                          /**< Mode DEFAULT for FEFILT_DCCOMPFILTINIT      */
#define FEFILT_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT     (_FEFILT_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_DCCOMPFILTINIT*/
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALQ_SHIFT      15                                                    /**< Shift value for FEFILT_DCCOMPINITVALQ       */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALQ_MASK       0x3FFF8000UL                                          /**< Bit mask for FEFILT_DCCOMPINITVALQ          */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT    0x00000000UL                                          /**< Mode DEFAULT for FEFILT_DCCOMPFILTINIT      */
#define FEFILT_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT     (_FEFILT_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for FEFILT_DCCOMPFILTINIT*/
#define FEFILT_DCCOMPFILTINIT_DCCOMPINIT                 (0x1UL << 30)                                         /**< Initialize filter state                     */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINIT_SHIFT          30                                                    /**< Shift value for FEFILT_DCCOMPINIT           */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINIT_MASK           0x40000000UL                                          /**< Bit mask for FEFILT_DCCOMPINIT              */
#define _FEFILT_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT        0x00000000UL                                          /**< Mode DEFAULT for FEFILT_DCCOMPFILTINIT      */
#define FEFILT_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT         (_FEFILT_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT << 30)     /**< Shifted mode DEFAULT for FEFILT_DCCOMPFILTINIT*/

/* Bit fields for FEFILT DCESTI */
#define _FEFILT_DCESTI_RESETVALUE                        0x00000000UL                                  /**< Default value for FEFILT_DCESTI             */
#define _FEFILT_DCESTI_MASK                              0x3FFFFFFFUL                                  /**< Mask for FEFILT_DCESTI                      */
#define _FEFILT_DCESTI_DCCOMPESTIVALI_SHIFT              0                                             /**< Shift value for FEFILT_DCCOMPESTIVALI       */
#define _FEFILT_DCESTI_DCCOMPESTIVALI_MASK               0x7FFFUL                                      /**< Bit mask for FEFILT_DCCOMPESTIVALI          */
#define _FEFILT_DCESTI_DCCOMPESTIVALI_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for FEFILT_DCESTI              */
#define FEFILT_DCESTI_DCCOMPESTIVALI_DEFAULT             (_FEFILT_DCESTI_DCCOMPESTIVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_DCESTI      */
#define _FEFILT_DCESTI_DCCOMPESTIVALQ_SHIFT              15                                            /**< Shift value for FEFILT_DCCOMPESTIVALQ       */
#define _FEFILT_DCESTI_DCCOMPESTIVALQ_MASK               0x3FFF8000UL                                  /**< Bit mask for FEFILT_DCCOMPESTIVALQ          */
#define _FEFILT_DCESTI_DCCOMPESTIVALQ_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for FEFILT_DCESTI              */
#define FEFILT_DCESTI_DCCOMPESTIVALQ_DEFAULT             (_FEFILT_DCESTI_DCCOMPESTIVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for FEFILT_DCESTI      */

/* Bit fields for FEFILT IRCAL */
#define _FEFILT_IRCAL_RESETVALUE                         0x00000000UL                                  /**< Default value for FEFILT_IRCAL              */
#define _FEFILT_IRCAL_MASK                               0x0000FFBFUL                                  /**< Mask for FEFILT_IRCAL                       */
#define FEFILT_IRCAL_IRCALEN                             (0x1UL << 0)                                  /**< IRCAL enable bit                            */
#define _FEFILT_IRCAL_IRCALEN_SHIFT                      0                                             /**< Shift value for FEFILT_IRCALEN              */
#define _FEFILT_IRCAL_IRCALEN_MASK                       0x1UL                                         /**< Bit mask for FEFILT_IRCALEN                 */
#define _FEFILT_IRCAL_IRCALEN_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_IRCALEN_DEFAULT                     (_FEFILT_IRCAL_IRCALEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for FEFILT_IRCAL       */
#define _FEFILT_IRCAL_MURSHF_SHIFT                       1                                             /**< Shift value for FEFILT_MURSHF               */
#define _FEFILT_IRCAL_MURSHF_MASK                        0x3EUL                                        /**< Bit mask for FEFILT_MURSHF                  */
#define _FEFILT_IRCAL_MURSHF_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_MURSHF_DEFAULT                      (_FEFILT_IRCAL_MURSHF_DEFAULT << 1)           /**< Shifted mode DEFAULT for FEFILT_IRCAL       */
#define _FEFILT_IRCAL_MUISHF_SHIFT                       7                                             /**< Shift value for FEFILT_MUISHF               */
#define _FEFILT_IRCAL_MUISHF_MASK                        0x1F80UL                                      /**< Bit mask for FEFILT_MUISHF                  */
#define _FEFILT_IRCAL_MUISHF_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_MUISHF_DEFAULT                      (_FEFILT_IRCAL_MUISHF_DEFAULT << 7)           /**< Shifted mode DEFAULT for FEFILT_IRCAL       */
#define FEFILT_IRCAL_IRCORREN                            (0x1UL << 13)                                 /**< IR Correction enable bit                    */
#define _FEFILT_IRCAL_IRCORREN_SHIFT                     13                                            /**< Shift value for FEFILT_IRCORREN             */
#define _FEFILT_IRCAL_IRCORREN_MASK                      0x2000UL                                      /**< Bit mask for FEFILT_IRCORREN                */
#define _FEFILT_IRCAL_IRCORREN_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_IRCORREN_DEFAULT                    (_FEFILT_IRCAL_IRCORREN_DEFAULT << 13)        /**< Shifted mode DEFAULT for FEFILT_IRCAL       */
#define FEFILT_IRCAL_IRCALCOEFRSTCMD                     (0x1UL << 14)                                 /**< IRCAL coef reset cmd                        */
#define _FEFILT_IRCAL_IRCALCOEFRSTCMD_SHIFT              14                                            /**< Shift value for FEFILT_IRCALCOEFRSTCMD      */
#define _FEFILT_IRCAL_IRCALCOEFRSTCMD_MASK               0x4000UL                                      /**< Bit mask for FEFILT_IRCALCOEFRSTCMD         */
#define _FEFILT_IRCAL_IRCALCOEFRSTCMD_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_IRCALCOEFRSTCMD_DEFAULT             (_FEFILT_IRCAL_IRCALCOEFRSTCMD_DEFAULT << 14) /**< Shifted mode DEFAULT for FEFILT_IRCAL       */
#define FEFILT_IRCAL_IRCALIFADCDBG                       (0x1UL << 15)                                 /**< IRCAL IFADC DBG                             */
#define _FEFILT_IRCAL_IRCALIFADCDBG_SHIFT                15                                            /**< Shift value for FEFILT_IRCALIFADCDBG        */
#define _FEFILT_IRCAL_IRCALIFADCDBG_MASK                 0x8000UL                                      /**< Bit mask for FEFILT_IRCALIFADCDBG           */
#define _FEFILT_IRCAL_IRCALIFADCDBG_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for FEFILT_IRCAL               */
#define FEFILT_IRCAL_IRCALIFADCDBG_DEFAULT               (_FEFILT_IRCAL_IRCALIFADCDBG_DEFAULT << 15)   /**< Shifted mode DEFAULT for FEFILT_IRCAL       */

/* Bit fields for FEFILT IRCALCOEF */
#define _FEFILT_IRCALCOEF_RESETVALUE                     0x00000000UL                          /**< Default value for FEFILT_IRCALCOEF          */
#define _FEFILT_IRCALCOEF_MASK                           0x7FFF7FFFUL                          /**< Mask for FEFILT_IRCALCOEF                   */
#define _FEFILT_IRCALCOEF_CRV_SHIFT                      0                                     /**< Shift value for FEFILT_CRV                  */
#define _FEFILT_IRCALCOEF_CRV_MASK                       0x7FFFUL                              /**< Bit mask for FEFILT_CRV                     */
#define _FEFILT_IRCALCOEF_CRV_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for FEFILT_IRCALCOEF           */
#define FEFILT_IRCALCOEF_CRV_DEFAULT                     (_FEFILT_IRCALCOEF_CRV_DEFAULT << 0)  /**< Shifted mode DEFAULT for FEFILT_IRCALCOEF   */
#define _FEFILT_IRCALCOEF_CIV_SHIFT                      16                                    /**< Shift value for FEFILT_CIV                  */
#define _FEFILT_IRCALCOEF_CIV_MASK                       0x7FFF0000UL                          /**< Bit mask for FEFILT_CIV                     */
#define _FEFILT_IRCALCOEF_CIV_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for FEFILT_IRCALCOEF           */
#define FEFILT_IRCALCOEF_CIV_DEFAULT                     (_FEFILT_IRCALCOEF_CIV_DEFAULT << 16) /**< Shifted mode DEFAULT for FEFILT_IRCALCOEF   */

