SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_fefilt.h
/* Bit fields for FEFILT IRCALCOEFWR */
#define _FEFILT_IRCALCOEFWR_RESETVALUE                   0x00000000UL                               /**< Default value for FEFILT_IRCALCOEFWR        */
#define _FEFILT_IRCALCOEFWR_MASK                         0xFFFFFFFFUL                               /**< Mask for FEFILT_IRCALCOEFWR                 */
#define _FEFILT_IRCALCOEFWR_CRVWD_SHIFT                  0                                          /**< Shift value for FEFILT_CRVWD                */
#define _FEFILT_IRCALCOEFWR_CRVWD_MASK                   0x7FFFUL                                   /**< Bit mask for FEFILT_CRVWD                   */
#define _FEFILT_IRCALCOEFWR_CRVWD_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for FEFILT_IRCALCOEFWR         */
#define FEFILT_IRCALCOEFWR_CRVWD_DEFAULT                 (_FEFILT_IRCALCOEFWR_CRVWD_DEFAULT << 0)   /**< Shifted mode DEFAULT for FEFILT_IRCALCOEFWR */
#define FEFILT_IRCALCOEFWR_CRVWEN                        (0x1UL << 15)                              /**< CIV Coefficient Write Enable                */
#define _FEFILT_IRCALCOEFWR_CRVWEN_SHIFT                 15                                         /**< Shift value for FEFILT_CRVWEN               */
#define _FEFILT_IRCALCOEFWR_CRVWEN_MASK                  0x8000UL                                   /**< Bit mask for FEFILT_CRVWEN                  */
#define _FEFILT_IRCALCOEFWR_CRVWEN_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for FEFILT_IRCALCOEFWR         */
#define FEFILT_IRCALCOEFWR_CRVWEN_DEFAULT                (_FEFILT_IRCALCOEFWR_CRVWEN_DEFAULT << 15) /**< Shifted mode DEFAULT for FEFILT_IRCALCOEFWR */
#define _FEFILT_IRCALCOEFWR_CIVWD_SHIFT                  16                                         /**< Shift value for FEFILT_CIVWD                */
#define _FEFILT_IRCALCOEFWR_CIVWD_MASK                   0x7FFF0000UL                               /**< Bit mask for FEFILT_CIVWD                   */
#define _FEFILT_IRCALCOEFWR_CIVWD_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for FEFILT_IRCALCOEFWR         */
#define FEFILT_IRCALCOEFWR_CIVWD_DEFAULT                 (_FEFILT_IRCALCOEFWR_CIVWD_DEFAULT << 16)  /**< Shifted mode DEFAULT for FEFILT_IRCALCOEFWR */
#define FEFILT_IRCALCOEFWR_CIVWEN                        (0x1UL << 31)                              /**< CIV Coefficient Write Enable                */
#define _FEFILT_IRCALCOEFWR_CIVWEN_SHIFT                 31                                         /**< Shift value for FEFILT_CIVWEN               */
#define _FEFILT_IRCALCOEFWR_CIVWEN_MASK                  0x80000000UL                               /**< Bit mask for FEFILT_CIVWEN                  */
#define _FEFILT_IRCALCOEFWR_CIVWEN_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for FEFILT_IRCALCOEFWR         */
#define FEFILT_IRCALCOEFWR_CIVWEN_DEFAULT                (_FEFILT_IRCALCOEFWR_CIVWEN_DEFAULT << 31) /**< Shifted mode DEFAULT for FEFILT_IRCALCOEFWR */

/** @} End of group EFR32FG25_FEFILT_BitFields */
/** @} End of group EFR32FG25_FEFILT */
/** @} End of group Parts */

#endif /* EFR32FG25_FEFILT_H */
